Qwen3_5ForConditionalGeneration(
  (model): Qwen3_5Model(
    (visual): Qwen3_5VisionModel(
      (patch_embed): Qwen3_5VisionPatchEmbed(
        (proj): Conv3d(3, 1024, kernel_size=(2, 16, 16), stride=(2, 16, 16))
      )
      (pos_embed): Embedding(2304, 1024)
      (rotary_pos_emb): Qwen3_5VisionRotaryEmbedding()
      (blocks): ModuleList(
        (0-23): 24 x Qwen3_5VisionBlock(
          (norm1): LayerNorm((1024,), eps=1e-06, elementwise_affine=True)
          (norm2): LayerNorm((1024,), eps=1e-06, elementwise_affine=True)
          (attn): Qwen3_5VisionAttention(
            (qkv): Linear(in_features=1024, out_features=3072, bias=True)
            (proj): Linear(in_features=1024, out_features=1024, bias=True)
          )
          (mlp): Qwen3_5VisionMLP(
            (linear_fc1): Linear(in_features=1024, out_features=4096, bias=True)
            (linear_fc2): Linear(in_features=4096, out_features=1024, bias=True)
            (act_fn): GELUTanh()
          )
        )
      )
      (merger): Qwen3_5VisionPatchMerger(
        (norm): LayerNorm((1024,), eps=1e-06, elementwise_affine=True)
        (linear_fc1): Linear(in_features=4096, out_features=4096, bias=True)
        (act_fn): GELU(approximate='none')
        (linear_fc2): Linear(in_features=4096, out_features=2048, bias=True)
      )
    )
    (language_model): Qwen3_5TextModel(
      (embed_tokens): Embedding(248320, 2048)
      (layers): ModuleList(
        (0-2): 3 x Qwen3_5DecoderLayer(
          (linear_attn): Qwen3_5GatedDeltaNet(
            (act): SiLUActivation()
            (conv1d): Conv1d(6144, 6144, kernel_size=(4,), stride=(1,), padding=(3,), groups=6144, bias=False)
            (norm): Qwen3_5RMSNormGated()
            (out_proj): Linear(in_features=2048, out_features=2048, bias=False)
            (in_proj_qkv): Linear(in_features=2048, out_features=6144, bias=False)
            (in_proj_z): Linear(in_features=2048, out_features=2048, bias=False)
            (in_proj_b): Linear(in_features=2048, out_features=16, bias=False)
            (in_proj_a): Linear(in_features=2048, out_features=16, bias=False)
          )
          (mlp): Qwen3_5MLP(
            (gate_proj): Linear(in_features=2048, out_features=6144, bias=False)
            (up_proj): Linear(in_features=2048, out_features=6144, bias=False)
            (down_proj): Linear(in_features=6144, out_features=2048, bias=False)
            (act_fn): SiLUActivation()
          )
          (input_layernorm): Qwen3_5RMSNorm((2048,), eps=1e-06)
          (post_attention_layernorm): Qwen3_5RMSNorm((2048,), eps=1e-06)
        )
        (3): Qwen3_5DecoderLayer(
          (self_attn): Qwen3_5Attention(
            (q_proj): Linear(in_features=2048, out_features=4096, bias=False)
            (k_proj): Linear(in_features=2048, out_features=512, bias=False)
            (v_proj): Linear(in_features=2048, out_features=512, bias=False)
            (o_proj): Linear(in_features=2048, out_features=2048, bias=False)
            (q_norm): Qwen3_5RMSNorm((256,), eps=1e-06)
            (k_norm): Qwen3_5RMSNorm((256,), eps=1e-06)
          )
          (mlp): Qwen3_5MLP(
            (gate_proj): Linear(in_features=2048, out_features=6144, bias=False)
            (up_proj): Linear(in_features=2048, out_features=6144, bias=False)
            (down_proj): Linear(in_features=6144, out_features=2048, bias=False)
            (act_fn): SiLUActivation()
          )
          (input_layernorm): Qwen3_5RMSNorm((2048,), eps=1e-06)
          (post_attention_layernorm): Qwen3_5RMSNorm((2048,), eps=1e-06)
        )
        (4-6): 3 x Qwen3_5DecoderLayer(
          (linear_attn): Qwen3_5GatedDeltaNet(
            (act): SiLUActivation()
            (conv1d): Conv1d(6144, 6144, kernel_size=(4,), stride=(1,), padding=(3,), groups=6144, bias=False)
            (norm): Qwen3_5RMSNormGated()
            (out_proj): Linear(in_features=2048, out_features=2048, bias=False)
            (in_proj_qkv): Linear(in_features=2048, out_features=6144, bias=False)
            (in_proj_z): Linear(in_features=2048, out_features=2048, bias=False)
            (in_proj_b): Linear(in_features=2048, out_features=16, bias=False)
            (in_proj_a): Linear(in_features=2048, out_features=16, bias=False)
          )
          (mlp): Qwen3_5MLP(
            (gate_proj): Linear(in_features=2048, out_features=6144, bias=False)
            (up_proj): Linear(in_features=2048, out_features=6144, bias=False)
            (down_proj): Linear(in_features=6144, out_features=2048, bias=False)
            (act_fn): SiLUActivation()
          )
          (input_layernorm): Qwen3_5RMSNorm((2048,), eps=1e-06)
          (post_attention_layernorm): Qwen3_5RMSNorm((2048,), eps=1e-06)
        )
        (7): Qwen3_5DecoderLayer(
          (self_attn): Qwen3_5Attention(
            (q_proj): Linear(in_features=2048, out_features=4096, bias=False)
            (k_proj): Linear(in_features=2048, out_features=512, bias=False)
            (v_proj): Linear(in_features=2048, out_features=512, bias=False)
            (o_proj): Linear(in_features=2048, out_features=2048, bias=False)
            (q_norm): Qwen3_5RMSNorm((256,), eps=1e-06)
            (k_norm): Qwen3_5RMSNorm((256,), eps=1e-06)
          )
          (mlp): Qwen3_5MLP(
            (gate_proj): Linear(in_features=2048, out_features=6144, bias=False)
            (up_proj): Linear(in_features=2048, out_features=6144, bias=False)
            (down_proj): Linear(in_features=6144, out_features=2048, bias=False)
            (act_fn): SiLUActivation()
          )
          (input_layernorm): Qwen3_5RMSNorm((2048,), eps=1e-06)
          (post_attention_layernorm): Qwen3_5RMSNorm((2048,), eps=1e-06)
        )
        (8-10): 3 x Qwen3_5DecoderLayer(
          (linear_attn): Qwen3_5GatedDeltaNet(
            (act): SiLUActivation()
            (conv1d): Conv1d(6144, 6144, kernel_size=(4,), stride=(1,), padding=(3,), groups=6144, bias=False)
            (norm): Qwen3_5RMSNormGated()
            (out_proj): Linear(in_features=2048, out_features=2048, bias=False)
            (in_proj_qkv): Linear(in_features=2048, out_features=6144, bias=False)
            (in_proj_z): Linear(in_features=2048, out_features=2048, bias=False)
            (in_proj_b): Linear(in_features=2048, out_features=16, bias=False)
            (in_proj_a): Linear(in_features=2048, out_features=16, bias=False)
          )
          (mlp): Qwen3_5MLP(
            (gate_proj): Linear(in_features=2048, out_features=6144, bias=False)
            (up_proj): Linear(in_features=2048, out_features=6144, bias=False)
            (down_proj): Linear(in_features=6144, out_features=2048, bias=False)
            (act_fn): SiLUActivation()
          )
          (input_layernorm): Qwen3_5RMSNorm((2048,), eps=1e-06)
          (post_attention_layernorm): Qwen3_5RMSNorm((2048,), eps=1e-06)
        )
        (11): Qwen3_5DecoderLayer(
          (self_attn): Qwen3_5Attention(
            (q_proj): Linear(in_features=2048, out_features=4096, bias=False)
            (k_proj): Linear(in_features=2048, out_features=512, bias=False)
            (v_proj): Linear(in_features=2048, out_features=512, bias=False)
            (o_proj): Linear(in_features=2048, out_features=2048, bias=False)
            (q_norm): Qwen3_5RMSNorm((256,), eps=1e-06)
            (k_norm): Qwen3_5RMSNorm((256,), eps=1e-06)
          )
          (mlp): Qwen3_5MLP(
            (gate_proj): Linear(in_features=2048, out_features=6144, bias=False)
            (up_proj): Linear(in_features=2048, out_features=6144, bias=False)
            (down_proj): Linear(in_features=6144, out_features=2048, bias=False)
            (act_fn): SiLUActivation()
          )
          (input_layernorm): Qwen3_5RMSNorm((2048,), eps=1e-06)
          (post_attention_layernorm): Qwen3_5RMSNorm((2048,), eps=1e-06)
        )
        (12-14): 3 x Qwen3_5DecoderLayer(
          (linear_attn): Qwen3_5GatedDeltaNet(
            (act): SiLUActivation()
            (conv1d): Conv1d(6144, 6144, kernel_size=(4,), stride=(1,), padding=(3,), groups=6144, bias=False)
            (norm): Qwen3_5RMSNormGated()
            (out_proj): Linear(in_features=2048, out_features=2048, bias=False)
            (in_proj_qkv): Linear(in_features=2048, out_features=6144, bias=False)
            (in_proj_z): Linear(in_features=2048, out_features=2048, bias=False)
            (in_proj_b): Linear(in_features=2048, out_features=16, bias=False)
            (in_proj_a): Linear(in_features=2048, out_features=16, bias=False)
          )
          (mlp): Qwen3_5MLP(
            (gate_proj): Linear(in_features=2048, out_features=6144, bias=False)
            (up_proj): Linear(in_features=2048, out_features=6144, bias=False)
            (down_proj): Linear(in_features=6144, out_features=2048, bias=False)
            (act_fn): SiLUActivation()
          )
          (input_layernorm): Qwen3_5RMSNorm((2048,), eps=1e-06)
          (post_attention_layernorm): Qwen3_5RMSNorm((2048,), eps=1e-06)
        )
        (15): Qwen3_5DecoderLayer(
          (self_attn): Qwen3_5Attention(
            (q_proj): Linear(in_features=2048, out_features=4096, bias=False)
            (k_proj): Linear(in_features=2048, out_features=512, bias=False)
            (v_proj): Linear(in_features=2048, out_features=512, bias=False)
            (o_proj): Linear(in_features=2048, out_features=2048, bias=False)
            (q_norm): Qwen3_5RMSNorm((256,), eps=1e-06)
            (k_norm): Qwen3_5RMSNorm((256,), eps=1e-06)
          )
          (mlp): Qwen3_5MLP(
            (gate_proj): Linear(in_features=2048, out_features=6144, bias=False)
            (up_proj): Linear(in_features=2048, out_features=6144, bias=False)
            (down_proj): Linear(in_features=6144, out_features=2048, bias=False)
            (act_fn): SiLUActivation()
          )
          (input_layernorm): Qwen3_5RMSNorm((2048,), eps=1e-06)
          (post_attention_layernorm): Qwen3_5RMSNorm((2048,), eps=1e-06)
        )
        (16-18): 3 x Qwen3_5DecoderLayer(
          (linear_attn): Qwen3_5GatedDeltaNet(
            (act): SiLUActivation()
            (conv1d): Conv1d(6144, 6144, kernel_size=(4,), stride=(1,), padding=(3,), groups=6144, bias=False)
            (norm): Qwen3_5RMSNormGated()
            (out_proj): Linear(in_features=2048, out_features=2048, bias=False)
            (in_proj_qkv): Linear(in_features=2048, out_features=6144, bias=False)
            (in_proj_z): Linear(in_features=2048, out_features=2048, bias=False)
            (in_proj_b): Linear(in_features=2048, out_features=16, bias=False)
            (in_proj_a): Linear(in_features=2048, out_features=16, bias=False)
          )
          (mlp): Qwen3_5MLP(
            (gate_proj): Linear(in_features=2048, out_features=6144, bias=False)
            (up_proj): Linear(in_features=2048, out_features=6144, bias=False)
            (down_proj): Linear(in_features=6144, out_features=2048, bias=False)
            (act_fn): SiLUActivation()
          )
          (input_layernorm): Qwen3_5RMSNorm((2048,), eps=1e-06)
          (post_attention_layernorm): Qwen3_5RMSNorm((2048,), eps=1e-06)
        )
        (19): Qwen3_5DecoderLayer(
          (self_attn): Qwen3_5Attention(
            (q_proj): Linear(in_features=2048, out_features=4096, bias=False)
            (k_proj): Linear(in_features=2048, out_features=512, bias=False)
            (v_proj): Linear(in_features=2048, out_features=512, bias=False)
            (o_proj): Linear(in_features=2048, out_features=2048, bias=False)
            (q_norm): Qwen3_5RMSNorm((256,), eps=1e-06)
            (k_norm): Qwen3_5RMSNorm((256,), eps=1e-06)
          )
          (mlp): Qwen3_5MLP(
            (gate_proj): Linear(in_features=2048, out_features=6144, bias=False)
            (up_proj): Linear(in_features=2048, out_features=6144, bias=False)
            (down_proj): Linear(in_features=6144, out_features=2048, bias=False)
            (act_fn): SiLUActivation()
          )
          (input_layernorm): Qwen3_5RMSNorm((2048,), eps=1e-06)
          (post_attention_layernorm): Qwen3_5RMSNorm((2048,), eps=1e-06)
        )
        (20-22): 3 x Qwen3_5DecoderLayer(
          (linear_attn): Qwen3_5GatedDeltaNet(
            (act): SiLUActivation()
            (conv1d): Conv1d(6144, 6144, kernel_size=(4,), stride=(1,), padding=(3,), groups=6144, bias=False)
            (norm): Qwen3_5RMSNormGated()
            (out_proj): Linear(in_features=2048, out_features=2048, bias=False)
            (in_proj_qkv): Linear(in_features=2048, out_features=6144, bias=False)
            (in_proj_z): Linear(in_features=2048, out_features=2048, bias=False)
            (in_proj_b): Linear(in_features=2048, out_features=16, bias=False)
            (in_proj_a): Linear(in_features=2048, out_features=16, bias=False)
          )
          (mlp): Qwen3_5MLP(
            (gate_proj): Linear(in_features=2048, out_features=6144, bias=False)
            (up_proj): Linear(in_features=2048, out_features=6144, bias=False)
            (down_proj): Linear(in_features=6144, out_features=2048, bias=False)
            (act_fn): SiLUActivation()
          )
          (input_layernorm): Qwen3_5RMSNorm((2048,), eps=1e-06)
          (post_attention_layernorm): Qwen3_5RMSNorm((2048,), eps=1e-06)
        )
        (23): Qwen3_5DecoderLayer(
          (self_attn): Qwen3_5Attention(
            (q_proj): Linear(in_features=2048, out_features=4096, bias=False)
            (k_proj): Linear(in_features=2048, out_features=512, bias=False)
            (v_proj): Linear(in_features=2048, out_features=512, bias=False)
            (o_proj): Linear(in_features=2048, out_features=2048, bias=False)
            (q_norm): Qwen3_5RMSNorm((256,), eps=1e-06)
            (k_norm): Qwen3_5RMSNorm((256,), eps=1e-06)
          )
          (mlp): Qwen3_5MLP(
            (gate_proj): Linear(in_features=2048, out_features=6144, bias=False)
            (up_proj): Linear(in_features=2048, out_features=6144, bias=False)
            (down_proj): Linear(in_features=6144, out_features=2048, bias=False)
            (act_fn): SiLUActivation()
          )
          (input_layernorm): Qwen3_5RMSNorm((2048,), eps=1e-06)
          (post_attention_layernorm): Qwen3_5RMSNorm((2048,), eps=1e-06)
        )
      )
      (norm): Qwen3_5RMSNorm((2048,), eps=1e-06)
      (rotary_emb): Qwen3_5TextRotaryEmbedding()
    )
  )
  (lm_head): Linear(in_features=2048, out_features=248320, bias=False)
)